app/Models/ModelAuth.php

    public function LoginUser($email, $password)
    {
        return  $this->db->table('tbl_user')
            ->where([
                'email' => $email,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '1234'

    public function LoginAnggota($nis, $password)
    {
        return  $this->db->table('tbl_anggota')
            ->where([
                'nis' => $nis,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_anggota`
WHERE `nis` = '1292005'
AND `password` = '1234'