app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_buku`
---
   public function TotalBuku()
   {
    return $this->db->table('tbl_buku')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_anggota`
---
   public function TotalAnggota()
   {
     return $this->db->table('tbl_anggota')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
   public function TotalUser()
   {
     return $this->db->table('tbl_user')->countAll();