app/Models/ModelAnggota.php

SELECT *
FROM `tbl_anggota`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_anggota`.`id_kelas`
WHERE `id_anggota` = '8'
---
   public function ProfileAnggota($id_anggota)
   {
    return $this->db->table('tbl_anggota')
        ->join('tbl_kelas','tbl_kelas.id_kelas = tbl_anggota.id_kelas', 'left')
        ->where('id_anggota', $id_anggota)
        ->get()->getRowArray();

SELECT *
FROM `tbl_anggota`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_anggota`.`id_kelas`
ORDER BY `id_anggota` DESC
---
   public function AllData()
   {
       return $this->db->table('tbl_anggota')
       ->join('tbl_kelas','tbl_kelas.id_kelas = tbl_anggota.id_kelas', 'left')
       ->orderBy('id_anggota', 'DESC')
       ->get()->getResultArray();

UPDATE `tbl_anggota` SET `id_anggota` = '8', `verifikasi` = '1'
WHERE `id_anggota` = '8'
---
   public function EditData($data)
   {
       $this->db->table('tbl_anggota')
       ->where('id_anggota', $data['id_anggota'])
       ->update($data);