app/Models/ModelPeminjaman.php

   public function PengajuanBuku($id_anggota)
   {
    return $this->db->table('tbl_peminjaman')
    ->join('tbl_buku','tbl_buku.id_buku = tbl_peminjaman.id_buku', 'left')
    ->join('tbl_kategori','tbl_kategori.id_kategori = tbl_buku.id_kategori', 'left')
    ->join('tbl_penerbit','tbl_penerbit.id_penerbit = tbl_buku.id_penerbit', 'left')
    ->join('tbl_penulis','tbl_penulis.id_penulis = tbl_buku.id_penulis', 'left')
    ->join('tbl_rak','tbl_rak.id_rak = tbl_buku.id_rak', 'left')
    ->where('id_anggota', $id_anggota)
    ->where('status_pinjam', 'Diajukan')
    ->get()->getResultArray();
---
SELECT *
FROM `tbl_peminjaman`
LEFT JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_peminjaman`.`id_buku`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_buku`.`id_kategori`
LEFT JOIN `tbl_penerbit` ON `tbl_penerbit`.`id_penerbit` = `tbl_buku`.`id_penerbit`
LEFT JOIN `tbl_penulis` ON `tbl_penulis`.`id_penulis` = `tbl_buku`.`id_penulis`
LEFT JOIN `tbl_rak` ON `tbl_rak`.`id_rak` = `tbl_buku`.`id_rak`
WHERE `id_anggota` = '8'
AND `status_pinjam` = 'Diajukan'