app/Models/ModelBuku.php

SELECT *
FROM `tbl_buku`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_buku`.`id_kategori`
LEFT JOIN `tbl_penerbit` ON `tbl_penerbit`.`id_penerbit` = `tbl_buku`.`id_penerbit`
LEFT JOIN `tbl_penulis` ON `tbl_penulis`.`id_penulis` = `tbl_buku`.`id_penulis`
LEFT JOIN `tbl_rak` ON `tbl_rak`.`id_rak` = `tbl_buku`.`id_rak`
ORDER BY `id_buku` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_buku')
        ->join('tbl_kategori','tbl_kategori.id_kategori = tbl_buku.id_kategori', 'left')
        ->join('tbl_penerbit','tbl_penerbit.id_penerbit = tbl_buku.id_penerbit', 'left')
        ->join('tbl_penulis','tbl_penulis.id_penulis = tbl_buku.id_penulis', 'left')
        ->join('tbl_rak','tbl_rak.id_rak = tbl_buku.id_rak', 'left')
        ->orderBy('id_buku', 'DESC')
        ->get()->getResultArray();